package main;

import java.io.PrintStream;
import java.util.Scanner;

public class Main {
    // Объявляем объект класса Scanner для ввода данных  
    public static Scanner in = new Scanner(System.in);
    // Объявляем объект класса PrintStream для вывода данных
    public static PrintStream out = System.out;

    public static void main(String[] args){ 
        // Считываем четыре целых числа(длины сторон A,B,C,D) из консоли
        int A = in.nextInt();
        int B = in.nextInt();
        int C = in.nextInt();
        int D = in.nextInt();

        // Создаем счётчик(в который будем записывать количество квадратов, которые удастся разместить в строго убывающей последовательности) и присваиваем ему значение
        // (Начальное значение 1, потому что первый кквадрат(самый большой) всегда можно поставить)
        int count = 1;
       
        // Сравниваем значения А и В (чтобы узнать различные ли они)
        if (A != B) {
            // Если А и В различны, то увеличивает count(наш счетчик) на 1
            count++;
        }

        // сравниваем С с А и В
        if (C != A && C != B) {
            // Если С отлична от А и отлична от В, то увеличиваем count на 1
            count++;
        }

        // Сравниваем D с А, D с В и D с С
        if (D != A && D != B && D != C) {
            // Если D отлична от А, отлична от В и отлична он С, то увеличиваем count на 1
            count++;
        }
        // Выводим count(наш счетчик, указывающий на количество квадратов, которые удастся разместить в строго убывающей последовательности)
        out.println(count);
    }
}